spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat_cmd_at.cpp
/**
 * @file smd_sat_cmd_at.cpp
 * @brief AT/UART command layer for SMD satellite module.
 *
 * UART lifecycle and deferred RX are handled by NrfUartAsync base class.
 * This file implements: SMD AT response parsing and command interface.
 */

#include "smd_sat_cmd_at.hpp"
#include "debug.hpp"
#include "pmu.hpp"
#include "binascii.hpp"
#include "error.hpp"   // ErrorCode (RESOURCE_NOT_AVAILABLE) thrown by the credential commands

#include "nrf_delay.h"

#include <cstring>
#include <cstdio>
#include <algorithm>

// ============================================================================
// Constructor / Destructor — delegate to NrfUartAsync
// ============================================================================

SmdSatCmdAt::SmdSatCmdAt(unsigned int uart_instance)
	: NrfUartAsync(uart_instance)
	, m_resp_ok(false)
	, m_resp_error(false)
	, m_resp_data_ready(false)
	, m_tx_complete(false)
	, m_tx_status(0xFFFF)
	, m_tx_in_progress(false)
	, m_dfu_mode(false)
{
}

SmdSatCmdAt::~SmdSatCmdAt()
{
	NrfUartAsync::deinit();
}

// ============================================================================
// Transport lifecycle — delegate to NrfUartAsync
// ============================================================================

void SmdSatCmdAt::init()
{
	NrfUartAsync::init();  // Uses BSP default baudrate
	m_dfu_mode = false;
}

void SmdSatCmdAt::deinit()
{
	NrfUartAsync::deinit();
}

// ============================================================================
// NrfUartAsync callbacks — protocol parsing
// ============================================================================

void SmdSatCmdAt::on_rx_line(std::string& line)
{
	parse_response(line);
}

void SmdSatCmdAt::on_rx_error(unsigned int error_type)
{
	DEBUG_WARN("SmdSatCmdAt: UART error type=%02x", error_type);
}

// ============================================================================
// Response parsing
// ============================================================================

void SmdSatCmdAt::parse_response(const std::string& line)
{
	// All responses start with '+'
	if (line.empty() || line[0] != '+') return;

	// +OK
	if (line == "+OK") {
		m_resp_ok = true;
		return;
	}

	// +ERROR=<code>
	if (line.compare(0, 7, "+ERROR=") == 0) {
		m_resp_error = true;
		m_resp_ok = true; // Unblock the (synchronous) wait loop
		// If an async AT+TX is in flight, surface the rejection as a FAILED TX
		// completion so the state machine's is_tx_finished()/is_tx_successful()
		// poll fails fast, instead of waiting out the full TX timeout budget.
		if (m_tx_in_progress) {
			m_tx_status = 0xFFFF;   // non-zero → is_tx_successful() == false
			m_tx_complete = true;
			m_tx_in_progress = false;
		}
		DEBUG_WARN("SmdSatCmdAt: %s", line.c_str());
		return;
	}

	// +BOOT=OK
	if (line == "+BOOT=OK") {
		m_resp_ok = true;
		return;
	}

	// +DFU=OK[,<data>] or +DFU=ERR,<error>
	if (line.compare(0, 5, "+DFU=") == 0) {
		std::string dfu_resp = line.substr(5);
		if (dfu_resp.compare(0, 2, "OK") == 0) {
			m_resp_ok = true;
			if (dfu_resp.size() > 3 && dfu_resp[2] == ',') {
				m_dfu_resp_data = dfu_resp.substr(3);
			} else {
				m_dfu_resp_data.clear();
			}
		} else if (dfu_resp.compare(0, 3, "ERR") == 0) {
			m_resp_error = true;
			m_resp_ok = true;
			DEBUG_WARN("SmdSatCmdAt: DFU error: %s", dfu_resp.c_str());
		}
		return;
	}

	// +TX=<status>,<data> (async TX completion)
	if (line.compare(0, 4, "+TX=") == 0) {
		std::string tx_resp = line.substr(4);
		size_t comma = tx_resp.find(',');
		if (comma != std::string::npos) {
			try {
				m_tx_status = std::stoi(tx_resp.substr(0, comma));
			} catch (...) {
				m_tx_status = 0xFFFF;
			}
		}
		m_tx_complete = true;
		m_tx_in_progress = false;   // TX resolved (completion received)
		// Also set resp_ok since AT+TX waits for MAC acceptance
		m_resp_ok = true;
		return;
	}

	// Generic +KEY=<data> response
	size_t eq = line.find('=');
	if (eq != std::string::npos) {
		m_resp_key = line.substr(1, eq - 1); // Strip leading '+'
		m_resp_data = line.substr(eq + 1);
		m_resp_data_ready = true;
	}
}

// ============================================================================
// Low-level AT operations — use NrfUartAsync for UART
// ============================================================================

bool SmdSatCmdAt::send_at(const std::string& cmd, uint16_t timeout_ms)
{
	m_resp_ok = false;
	m_resp_error = false;
	m_resp_data_ready = false;

	if (!send_string(cmd + "\r\n")) return false;

	// Wait for +OK or +ERROR, draining ISR buffer each tick
	while (!m_resp_ok && timeout_ms > 0) {
		PMU::delay_ms(1);
		NrfUartAsync::process_rx();
		timeout_ms--;
	}

	if (timeout_ms == 0) {
		DEBUG_WARN("SmdSatCmdAt::send_at: timeout for '%s'", cmd.c_str());
		return false;
	}

	return !m_resp_error;
}

bool SmdSatCmdAt::send_at_with_data(const std::string& cmd, std::string& response_data, uint16_t timeout_ms)
{
	m_resp_ok = false;
	m_resp_error = false;
	m_resp_data_ready = false;
	m_resp_data.clear();

	if (!send_string(cmd + "\r\n")) return false;

	while (!m_resp_ok && timeout_ms > 0) {
		PMU::delay_ms(1);
		NrfUartAsync::process_rx();
		timeout_ms--;
	}

	if (timeout_ms == 0 || m_resp_error)
		return false;

	response_data = m_resp_data;
	return true;
}

bool SmdSatCmdAt::send_dfu(uint8_t cmd_id, const std::string& hex_data, uint16_t timeout_ms)
{
	std::string cmd = "AT+DFU=" + std::to_string(cmd_id);
	if (!hex_data.empty()) {
		cmd += "," + hex_data;
	}

	m_resp_ok = false;
	m_resp_error = false;
	m_dfu_resp_data.clear();

	if (!send_string(cmd + "\r\n")) return false;

	while (!m_resp_ok && timeout_ms > 0) {
		if (timeout_ms % 500 == 0) PMU::kick_watchdog();
		PMU::delay_ms(1);
		NrfUartAsync::process_rx();
		timeout_ms--;
	}

	return !m_resp_error && (timeout_ms > 0);
}

bool SmdSatCmdAt::send_dfu_with_data(uint8_t cmd_id, const std::string& hex_data,
                                      std::string& response_data, uint16_t timeout_ms)
{
	if (!send_dfu(cmd_id, hex_data, timeout_ms)) return false;
	response_data = m_dfu_resp_data;
	return true;
}

// ============================================================================
// Hex conversion helpers
// ============================================================================

std::string SmdSatCmdAt::bytes_to_hex(const uint8_t *data, uint16_t len)
{
	std::string hex;
	hex.reserve(len * 2);
	for (uint16_t i = 0; i < len; i++) {
		char buf[3];
		snprintf(buf, sizeof(buf), "%02x", data[i]);
		hex += buf;
	}
	return hex;
}

