spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat_cmd_at.cpp
uint16_t SmdSatCmdAt::hex_to_bytes(const std::string& hex, uint8_t *data, uint16_t max_len)
{
	uint16_t len = hex.size() / 2;
	if (len > max_len) len = max_len;
	for (uint16_t i = 0; i < len; i++) {
		unsigned int val;
		if (sscanf(hex.c_str() + i * 2, "%2x", &val) != 1)
			return i;  // Return number of bytes successfully converted
		data[i] = static_cast<uint8_t>(val);
	}
	return len;
}

// ============================================================================
// Basic communication
// ============================================================================

bool SmdSatCmdAt::ping()
{
	return send_at("AT+PING=?");
}

void SmdSatCmdAt::sync()
{
	// No sync needed for UART
}

// ============================================================================
// Identification & credentials
// ============================================================================

void SmdSatCmdAt::read_id(uint32_t *id)
{
	std::string data;
	if (send_at_with_data("AT+ID=?", data) && !data.empty()) {
		try {
			*id = std::stoul(data);
		} catch (...) {
			*id = 0;
			throw ErrorCode::RESOURCE_NOT_AVAILABLE;
		}
	} else {
		throw ErrorCode::RESOURCE_NOT_AVAILABLE;
	}
}

void SmdSatCmdAt::set_id(uint32_t id)
{
	if (!send_at("AT+ID=" + std::to_string(id))) {
		throw ErrorCode::RESOURCE_NOT_AVAILABLE;
	}
}

void SmdSatCmdAt::read_address(smd_uint8_array_t *address)
{
	std::string data;
	if (send_at_with_data("AT+ADDR=?", data) && !data.empty()) {
		hex_to_bytes(data, address->p_data, address->size);
	} else {
		throw ErrorCode::RESOURCE_NOT_AVAILABLE;
	}
}

void SmdSatCmdAt::set_address(smd_uint8_array_t *address)
{
	std::string hex = bytes_to_hex(address->p_data, address->size);
	if (!send_at("AT+ADDR=" + hex)) {
		throw ErrorCode::RESOURCE_NOT_AVAILABLE;
	}
}

void SmdSatCmdAt::read_seckey(smd_uint8_array_t *seckey)
{
	std::string data;
	if (send_at_with_data("AT+SECKEY=?", data) && !data.empty()) {
		hex_to_bytes(data, seckey->p_data, seckey->size);
	} else {
		throw ErrorCode::RESOURCE_NOT_AVAILABLE;
	}
}

void SmdSatCmdAt::set_seckey(smd_uint8_array_t *seckey)
{
	std::string hex = bytes_to_hex(seckey->p_data, seckey->size);
	if (!send_at("AT+SECKEY=" + hex)) {
		throw ErrorCode::RESOURCE_NOT_AVAILABLE;
	}
}

void SmdSatCmdAt::read_serial(smd_uint8_array_t *serial)
{
	std::string data;
	if (send_at_with_data("AT+SN=?", data) && !data.empty()) {
		uint16_t len = std::min(static_cast<uint16_t>(data.size()), serial->size);
		memcpy(serial->p_data, data.c_str(), len);
		serial->size = len;
	} else {
		throw ErrorCode::RESOURCE_NOT_AVAILABLE;
	}
}

// ============================================================================
// Radio configuration
// ============================================================================

void SmdSatCmdAt::set_radio_conf(smd_uint8_array_t *radio_conf)
{
	std::string hex = bytes_to_hex(radio_conf->p_data, radio_conf->size);
	if (!send_at("AT+RCONF=" + hex)) {
		throw ErrorCode::RESOURCE_NOT_AVAILABLE;
	}
}

void SmdSatCmdAt::read_radio_conf(SmdArgosModulation *modulation)
{
	std::string data;
	if (send_at_with_data("AT+RCONF=?", data) && !data.empty()) {
		// Response: <min_freq>,<max_freq>,<rf_level>,<modulation>
		// Extract modulation string (last field)
		size_t last_comma = data.rfind(',');
		if (last_comma != std::string::npos) {
			std::string mod_str = data.substr(last_comma + 1);
			if (mod_str == "LDA2" || mod_str == "LDA2L") {
				*modulation = ARGOS_MOD_LDA2;
			} else if (mod_str == "LDK") {
				*modulation = ARGOS_MOD_LDK;
			} else if (mod_str == "VLDA4") {
				*modulation = ARGOS_MOD_VLDA4;
			} else {
				*modulation = ARGOS_MOD_LDA2; // Default
			}
		}
	} else {
		throw ErrorCode::RESOURCE_NOT_AVAILABLE;
	}
}

bool SmdSatCmdAt::save_radio_conf()
{
	return send_at("AT+SAVE_RCONF");
}

void SmdSatCmdAt::read_rconf_raw(uint8_t *rconf_raw, uint16_t *len)
{
	std::string data;
	if (send_at_with_data("AT+RCONFRAW=?", data) && !data.empty()) {
		*len = hex_to_bytes(data, rconf_raw, SMDSAT_CMD_READ_RCONF_RAW_LEN);
	} else {
		throw ErrorCode::RESOURCE_NOT_AVAILABLE;
	}
}

// ============================================================================
// KMAC
// ============================================================================

void SmdSatCmdAt::load_kmac_profil(uint8_t profile)
{
	if (!send_at("AT+KMAC=" + std::to_string(profile))) {
		throw ErrorCode::RESOURCE_NOT_AVAILABLE;
	}
}

void SmdSatCmdAt::read_kmac(uint8_t *profile)
{
	std::string data;
	if (send_at_with_data("AT+KMAC=?", data) && !data.empty()) {
		// Response: <profile_id>,<config_hex>
		try {
			*profile = std::stoi(data.substr(0, data.find(',')));
		} catch (...) {
			*profile = 0;
		}
	} else {
		throw ErrorCode::RESOURCE_NOT_AVAILABLE;
	}
}

void SmdSatCmdAt::get_kmac_status(uint8_t *status)
{
	// AT interface has no direct KMAC status query
	// After KMAC load, status is OK if no error was returned
	*status = MAC_OK;
}

// ============================================================================
// Power / LPM
// ============================================================================

void SmdSatCmdAt::read_lpm(uint8_t *lpm_mode)
{
	std::string data;
	if (send_at_with_data("AT+LPM=?", data) && !data.empty()) {
		try {
			*lpm_mode = static_cast<uint8_t>(std::stoul(data, nullptr, 16));
		} catch (...) {
			*lpm_mode = 0;
		}
	} else {
		throw ErrorCode::RESOURCE_NOT_AVAILABLE;
	}
}

void SmdSatCmdAt::write_lpm(uint8_t *lpm_mode)
{
	char buf[8];
	snprintf(buf, sizeof(buf), "0x%02X", *lpm_mode);
	if (!send_at(std::string("AT+LPM=") + buf)) {
		throw ErrorCode::RESOURCE_NOT_AVAILABLE;
	}
}

// ============================================================================
// TCXO
// ============================================================================

void SmdSatCmdAt::read_tcxo_warmup(uint32_t *time_ms)
{
	std::string data;
	if (send_at_with_data("AT+TCXO_WU=?", data) && !data.empty()) {
		try {
			*time_ms = std::stoul(data);
		} catch (...) {
			*time_ms = 0;
		}
	} else {
		throw ErrorCode::RESOURCE_NOT_AVAILABLE;
	}
}

