spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat_cmd_at.cpp
bool SmdSatCmdAt::dfu_get_bootloader_info(SmdDfuInfo *info)
{
	if (!m_dfu_mode || !info) return false;

	// GET_INFO = cmd_id 2
	std::string resp;
	if (!send_dfu_with_data(2, "", resp, 2000)) return false;

	// Parse response: hex data containing version, app_start, max_size, page_size
	uint8_t data[32] = {0};
	uint16_t len = hex_to_bytes(resp, data, sizeof(data));

	if (len >= 15) {
		info->version_major = data[0];
		info->version_minor = data[1];
		info->version_patch = data[2];
		info->app_start_addr = data[3] | (data[4] << 8) | (data[5] << 16) | (data[6] << 24);
		info->app_max_size = data[7] | (data[8] << 8) | (data[9] << 16) | (data[10] << 24);
		info->flash_page_size = data[11] | (data[12] << 8) | (data[13] << 16) | (data[14] << 24);

		DEBUG_INFO("SmdSatCmdAt::%s: BL v%u.%u.%u | app=0x%08X | max=%u | page=%u",
		           __func__, info->version_major, info->version_minor, info->version_patch,
		           info->app_start_addr, info->app_max_size, info->flash_page_size);
	}

	return true;
}

SmdDfuResponse SmdSatCmdAt::dfu_erase()
{
	DEBUG_INFO("SmdSatCmdAt::%s: Erasing flash...", __func__);
	PMU::kick_watchdog();

	// ERASE = cmd_id 3, long timeout (flash erase ~3s)
	if (send_dfu(3, "", 10000)) {
		DEBUG_INFO("SmdSatCmdAt::%s: Erase OK", __func__);
		return DFU_RSP_OK;
	}
	return DFU_RSP_ERROR;
}

SmdDfuResponse SmdSatCmdAt::dfu_write_chunk(uint32_t addr, const uint8_t *data, uint16_t len)
{
	if (!data || len == 0 || len > SMDSAT_DFU_CHUNK_SIZE) {
		return DFU_RSP_SIZE_ERROR;
	}

	// WRITE = cmd_id 4, payload: <addr_4B_LE><data>
	// Build hex: 4 bytes addr (LE) + data
	uint8_t header[4] = {
		static_cast<uint8_t>(addr & 0xFF),
		static_cast<uint8_t>((addr >> 8) & 0xFF),
		static_cast<uint8_t>((addr >> 16) & 0xFF),
		static_cast<uint8_t>((addr >> 24) & 0xFF)
	};

	std::string hex = bytes_to_hex(header, 4) + bytes_to_hex(data, len);

	if (send_dfu(4, hex, 3000)) {
		return DFU_RSP_OK;
	}
	return DFU_RSP_ERROR;
}

SmdDfuResponse SmdSatCmdAt::dfu_read_chunk(uint32_t addr, uint8_t *data, uint16_t len)
{
	if (!data || len == 0) return DFU_RSP_SIZE_ERROR;

	// READ = cmd_id 5, payload: <addr_4B_LE><len_2B_LE>
	uint8_t req[6] = {
		static_cast<uint8_t>(addr & 0xFF), static_cast<uint8_t>((addr >> 8) & 0xFF),
		static_cast<uint8_t>((addr >> 16) & 0xFF), static_cast<uint8_t>((addr >> 24) & 0xFF),
		static_cast<uint8_t>(len & 0xFF), static_cast<uint8_t>((len >> 8) & 0xFF)
	};

	std::string resp;
	if (send_dfu_with_data(5, bytes_to_hex(req, 6), resp, 3000)) {
		hex_to_bytes(resp, data, len);
		return DFU_RSP_OK;
	}
	return DFU_RSP_ERROR;
}

SmdDfuResponse SmdSatCmdAt::dfu_verify(uint32_t crc32)
{
	// VERIFY = cmd_id 6, payload: <crc32_4B_LE>
	uint8_t crc_data[4] = {
		static_cast<uint8_t>(crc32 & 0xFF), static_cast<uint8_t>((crc32 >> 8) & 0xFF),
		static_cast<uint8_t>((crc32 >> 16) & 0xFF), static_cast<uint8_t>((crc32 >> 24) & 0xFF)
	};

	if (send_dfu(6, bytes_to_hex(crc_data, 4), 5000)) {
		DEBUG_INFO("SmdSatCmdAt::%s: CRC OK", __func__);
		return DFU_RSP_OK;
	}
	return DFU_RSP_ERROR;
}

SmdDfuResponse SmdSatCmdAt::dfu_jump()
{
	DEBUG_INFO("SmdSatCmdAt::%s: Jumping to app...", __func__);

	// JUMP = cmd_id 8
	send_dfu(8, "", 3000);
	m_dfu_mode = false;
	nrf_delay_ms(SMDSAT_DFU_RESET_DELAY_MS);

	return DFU_RSP_OK;
}

uint32_t SmdSatCmdAt::calculate_crc32(const uint8_t *data, size_t len)
{
	return spi_crc32_mpeg2(data, len);
}

// ============================================================================
// Debug / test
// ============================================================================

std::string SmdSatCmdAt::run_command_test()
{
	DEBUG_INFO("SmdSatCmdAt::%s: === AT COMMAND TEST START ===", __func__);

	struct CmdTest {
		const char *cmd;
		const char *name;
	};

	CmdTest tests[] = {
		{ "AT+PING=?",     "PING" },
		{ "AT+VERSION=?",  "VERSION" },
		{ "AT+FW=?",       "FW" },
		{ "AT+ID=?",       "ID" },
		{ "AT+ADDR=?",     "ADDR" },
		{ "AT+SECKEY=?",   "SECKEY" },
		{ "AT+SN=?",       "SN" },
		{ "AT+RCONF=?",    "RCONF" },
		{ "AT+RCONFRAW=?", "RCONFRAW" },
		{ "AT+KMAC=?",     "KMAC" },
		{ "AT+LPM=?",      "LPM" },
		{ "AT+TCXO_WU=?",  "TCXO_WU" },
	};

	uint8_t pass_count = 0;
	uint8_t num_tests = sizeof(tests) / sizeof(tests[0]);
	std::string fails;

	for (uint8_t i = 0; i < num_tests; i++) {
		std::string data;
		bool ok = send_at_with_data(tests[i].cmd, data);

		if (ok) {
			pass_count++;
			DEBUG_INFO("  PASS: %s = %s", tests[i].name, data.c_str());
		} else {
			if (!fails.empty()) fails += " ";
			fails += tests[i].name;
			DEBUG_ERROR("  FAIL: %s", tests[i].name);
		}
		nrf_delay_ms(50);
	}

	std::string result = std::to_string(pass_count) + "/" + std::to_string(num_tests);
	if (fails.empty()) {
		result += " ALL OK";
	} else {
		result += " FAIL:" + fails;
	}

	DEBUG_INFO("SmdSatCmdAt::%s: === TEST RESULT: %s ===", __func__, result.c_str());
	return result;
}
